---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeIterator.HasCurrent
source: html/636defb5-503a-13f3-31c3-e053d36c96d1.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator.HasCurrent Method

Identifies if the iterator has a current item.

## Syntax (C#)
```csharp
public bool HasCurrent()
```

## Returns
True if there is a current item.

## Remarks
There is no current item if the iterator has not started yet or has been done.